In [25]:
import numpy as np

import pandas as pd

import matplotlib.pyplot as plt

print("numpy version=", np.__version__)

print("pandas version=", pd.__version__)

print(plt.__version__)

numpy version= 1.16.5
pandas version= 0.25.1

AttributeError: module 'matplotlib.pyplot' has no attribute '__version__'

In [7]:
s = pd.Series([ 1,3,5, np.nan, 6, 8])

s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [9]:
dates = pd.date_range('20130101', periods=6)

dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df = pd.DataFrame(np. random. randn(6,4), index=dates, columns=list('ABCD'))

df

                   A         B         C         D
2013-01-01  0.967271 -0.111453  3.102678  0.408772
2013-01-02  0.495757 -1.098300  0.164372  0.321165
2013-01-03 -0.269322 -0.114967  0.962147 -2.720784
2013-01-04  0.177464 -0.484596  0.338797  0.044104
2013-01-05  0.008086 -0.032451 -1.289378 -0.782050
2013-01-06  0.391115 -1.778480  0.039989  0.259445

In [15]:
df2 = pd.DataFrame({'A':1. , 
                   'B':pd.Timestamp('20130102'),
                   'C':pd.Series(1, index=list(range(4)), dtype='int32'),
                   'E':pd.Categorical(["test", "train","test", "train" ]),
                   'F':'foo'})

df2

     A          B  C      E    F
0  1.0 2013-01-02  1   test  foo
1  1.0 2013-01-02  1  train  foo
2  1.0 2013-01-02  1   test  foo
3  1.0 2013-01-02  1  train  foo

In [17]:
df2. dtypes

A           float64
B    datetime64[ns]
C             int32
E          category
F            object
dtype: object

In [19]:
df.to_numpy()

array([[-1.0856306 ,  0.99734545,  0.2829785 , -1.50629471],
       [-0.57860025,  1.65143654, -2.42667924, -0.42891263],
       [ 1.26593626, -0.8667404 , -0.67888615, -0.09470897],
       [ 1.49138963, -0.638902  , -0.44398196, -0.43435128],
       [ 2.20593008,  2.18678609,  1.0040539 ,  0.3861864 ],
       [ 0.73736858,  1.49073203, -0.93583387,  1.17582904]])

In [21]:
df2.to_numpy

<bound method DataFrame.to_numpy of      A          B  C      E    F
0  1.0 2013-01-02  1   test  foo
1  1.0 2013-01-02  1  train  foo
2  1.0 2013-01-02  1   test  foo
3  1.0 2013-01-02  1  train  foo>

In [23]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.672732  0.803443 -0.533058 -0.150375
std    1.267646  1.265904  1.166693  0.899617
min   -1.085631 -0.866740 -2.426679 -1.506295
25%   -0.249608 -0.229840 -0.871597 -0.432992
50%    1.001652  1.244039 -0.561434 -0.261811
75%    1.435026  1.611260  0.101238  0.265963
max    2.205930  2.186786  1.004054  1.175829

In [36]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

# Sort

In [27]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.506295  0.282978  0.997345 -1.085631
2013-01-02 -0.428913 -2.426679  1.651437 -0.578600
2013-01-03 -0.094709 -0.678886 -0.866740  1.265936
2013-01-04 -0.434351 -0.443982 -0.638902  1.491390
2013-01-05  0.386186  1.004054  2.186786  2.205930
2013-01-06  1.175829 -0.935834  1.490732  0.737369

In [29]:
df.sort_index(axis=1, ascending=True)

                   A         B         C         D
2013-01-01 -1.085631  0.997345  0.282978 -1.506295
2013-01-02 -0.578600  1.651437 -2.426679 -0.428913
2013-01-03  1.265936 -0.866740 -0.678886 -0.094709
2013-01-04  1.491390 -0.638902 -0.443982 -0.434351
2013-01-05  2.205930  2.186786  1.004054  0.386186
2013-01-06  0.737369  1.490732 -0.935834  1.175829

In [31]:
df.sort_values(by='B') # 오름차순

                   A         B         C         D
2013-01-03  1.265936 -0.866740 -0.678886 -0.094709
2013-01-04  1.491390 -0.638902 -0.443982 -0.434351
2013-01-01 -1.085631  0.997345  0.282978 -1.506295
2013-01-06  0.737369  1.490732 -0.935834  1.175829
2013-01-02 -0.578600  1.651437 -2.426679 -0.428913
2013-01-05  2.205930  2.186786  1.004054  0.386186

In [35]:
df.sort_values(by='B', ascending=False, inplace=False) # 내림차순, inplace=False는 원본은 그대로 둬라

                   A         B         C         D
2013-01-05  2.205930  2.186786  1.004054  0.386186
2013-01-02 -0.578600  1.651437 -2.426679 -0.428913
2013-01-06  0.737369  1.490732 -0.935834  1.175829
2013-01-01 -1.085631  0.997345  0.282978 -1.506295
2013-01-04  1.491390 -0.638902 -0.443982 -0.434351
2013-01-03  1.265936 -0.866740 -0.678886 -0.094709

# Selection

In [38]:
df['A']

2013-01-01   -1.085631
2013-01-02   -0.578600
2013-01-03    1.265936
2013-01-04    1.491390
2013-01-05    2.205930
2013-01-06    0.737369
Freq: D, Name: A, dtype: float64

In [42]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.085631  0.997345  0.282978 -1.506295
2013-01-02 -0.578600  1.651437 -2.426679 -0.428913
2013-01-03  1.265936 -0.866740 -0.678886 -0.094709

In [44]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.578600  1.651437 -2.426679 -0.428913
2013-01-03  1.265936 -0.866740 -0.678886 -0.094709
2013-01-04  1.491390 -0.638902 -0.443982 -0.434351

In [46]:
df.loc[dates[0]]

A   -1.085631
B    0.997345
C    0.282978
D   -1.506295
Name: 2013-01-01 00:00:00, dtype: float64

In [50]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -1.085631  0.997345
2013-01-02 -0.578600  1.651437
2013-01-03  1.265936 -0.866740
2013-01-04  1.491390 -0.638902
2013-01-05  2.205930  2.186786
2013-01-06  0.737369  1.490732

In [51]:
df.loc[dates[0], 'A']

-1.0856306033005612

In [52]:
# For getting fast access to a scalar(equivalent to the prior method)

df.at[dates[0], 'A']

-1.0856306033005612

In [56]:
df.iloc[3]

A    1.491390
B   -0.638902
C   -0.443982
D   -0.434351
Name: 2013-01-04 00:00:00, dtype: float64

In [58]:
df

                   A         B         C         D
2013-01-01 -1.085631  0.997345  0.282978 -1.506295
2013-01-02 -0.578600  1.651437 -2.426679 -0.428913
2013-01-03  1.265936 -0.866740 -0.678886 -0.094709
2013-01-04  1.491390 -0.638902 -0.443982 -0.434351
2013-01-05  2.205930  2.186786  1.004054  0.386186
2013-01-06  0.737369  1.490732 -0.935834  1.175829

In [59]:
df.iloc[3:5, 0:2]

                  A         B
2013-01-04  1.49139 -0.638902
2013-01-05  2.20593  2.186786

In [61]:
df.iloc[[1,2,4],[0,2]] # df.loc[행 인덱싱값, 열 인덱싱값]

                   A         C
2013-01-02 -0.578600 -2.426679
2013-01-03  1.265936 -0.678886
2013-01-05  2.205930  1.004054

In [62]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.578600  1.651437 -2.426679 -0.428913
2013-01-03  1.265936 -0.866740 -0.678886 -0.094709

In [64]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.997345  0.282978
2013-01-02  1.651437 -2.426679
2013-01-03 -0.866740 -0.678886
2013-01-04 -0.638902 -0.443982
2013-01-05  2.186786  1.004054
2013-01-06  1.490732 -0.935834

In [66]:
df[df.A > 0]

                   A         B         C         D
2013-01-03  1.265936 -0.866740 -0.678886 -0.094709
2013-01-04  1.491390 -0.638902 -0.443982 -0.434351
2013-01-05  2.205930  2.186786  1.004054  0.386186
2013-01-06  0.737369  1.490732 -0.935834  1.175829

In [68]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.997345  0.282978       NaN
2013-01-02       NaN  1.651437       NaN       NaN
2013-01-03  1.265936       NaN       NaN       NaN
2013-01-04  1.491390       NaN       NaN       NaN
2013-01-05  2.205930  2.186786  1.004054  0.386186
2013-01-06  0.737369  1.490732       NaN  1.175829

In [71]:
df2 = df.copy()

df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

df2

                   A         B         C         D      E
2013-01-01 -1.085631  0.997345  0.282978 -1.506295    one
2013-01-02 -0.578600  1.651437 -2.426679 -0.428913    one
2013-01-03  1.265936 -0.866740 -0.678886 -0.094709    two
2013-01-04  1.491390 -0.638902 -0.443982 -0.434351  three
2013-01-05  2.205930  2.186786  1.004054  0.386186   four
2013-01-06  0.737369  1.490732 -0.935834  1.175829  three

In [73]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  1.265936 -0.866740 -0.678886 -0.094709   two
2013-01-05  2.205930  2.186786  1.004054  0.386186  four

In [77]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C         D    E
2013-01-01 -1.085631  0.997345  0.282978 -1.506295  1.0
2013-01-02 -0.578600  1.651437 -2.426679 -0.428913  1.0
2013-01-03  1.265936 -0.866740 -0.678886 -0.094709  NaN
2013-01-04  1.491390 -0.638902 -0.443982 -0.434351  NaN

df1.dropna(how='any')

In [116]:
df1.dropna(how='any')

                   A         B         C         D    E
2013-01-01 -1.085631  0.997345  0.282978 -1.506295  1.0
2013-01-02 -0.578600  1.651437 -2.426679 -0.428913  1.0

In [81]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01 -1.085631  0.997345  0.282978 -1.506295  1.0
2013-01-02 -0.578600  1.651437 -2.426679 -0.428913  1.0
2013-01-03  1.265936 -0.866740 -0.678886 -0.094709  5.0
2013-01-04  1.491390 -0.638902 -0.443982 -0.434351  5.0

In [83]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [86]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [93]:
df.sub(s, axis='index')

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03  0.265936 -1.866740 -1.678886 -1.094709
2013-01-04 -1.508610 -3.638902 -3.443982 -3.434351
2013-01-05 -2.794070 -2.813214 -3.995946 -4.613814
2013-01-06       NaN       NaN       NaN       NaN

In [94]:
df

                   A         B         C         D
2013-01-01 -1.085631  0.997345  0.282978 -1.506295
2013-01-02 -0.578600  1.651437 -2.426679 -0.428913
2013-01-03  1.265936 -0.866740 -0.678886 -0.094709
2013-01-04  1.491390 -0.638902 -0.443982 -0.434351
2013-01-05  2.205930  2.186786  1.004054  0.386186
2013-01-06  0.737369  1.490732 -0.935834  1.175829

In [92]:
df.apply(np.cumsum) # 누적합

                   A         B         C         D
2013-01-01 -1.085631  0.997345  0.282978 -1.506295
2013-01-02 -1.664231  2.648782 -2.143701 -1.935207
2013-01-03 -0.398295  1.782042 -2.822587 -2.029916
2013-01-04  1.093095  1.143140 -3.266569 -2.464268
2013-01-05  3.299025  3.329926 -2.262515 -2.078081
2013-01-06  4.036394  4.820658 -3.198349 -0.902252

In [95]:
df.apply(lambda x: x.max() - x.min())

A    3.291561
B    3.053526
C    3.430733
D    2.682124
dtype: float64

In [98]:
s = pd.Series(np.random.randint(0, 7, size=10))

s

0    3
1    5
2    4
3    6
4    4
5    6
6    5
7    3
8    2
9    0
dtype: int32

In [100]:
s.value_counts()

6    2
5    2
4    2
3    2
2    1
0    1
dtype: int64

In [102]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# merge - 데이터끼리 합치기

In [105]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.909707  0.323730  1.043909 -0.481896
1 -0.565414  0.694983  1.154228 -3.198325
2 -1.540122 -0.524849  1.205430 -0.464659
3  0.582503  0.973116 -0.052731 -1.381555
4 -2.563025  0.062843 -1.491904  0.667223
5  0.214012  0.971047 -1.289668 -0.088493
6 -0.713274 -1.939280 -1.025596  0.641043
7  0.688676  0.188906 -0.028869 -0.831041
8 -0.499909  0.237228 -0.191196  1.054962
9 -2.478152 -3.298714  0.674685 -0.206624

In [108]:
pieces = [df[:3]]; pieces

[          0         1         2         3
 0  0.909707  0.323730  1.043909 -0.481896
 1 -0.565414  0.694983  1.154228 -3.198325
 2 -1.540122 -0.524849  1.205430 -0.464659]

In [113]:
pieces = [df[3:7]]; pieces

[          0         1         2         3
 3  0.582503  0.973116 -0.052731 -1.381555
 4 -2.563025  0.062843 -1.491904  0.667223
 5  0.214012  0.971047 -1.289668 -0.088493
 6 -0.713274 -1.939280 -1.025596  0.641043]

In [114]:
pieces = [df[7:]]; pieces

[          0         1         2         3
 7  0.688676  0.188906 -0.028869 -0.831041
 8 -0.499909  0.237228 -0.191196  1.054962
 9 -2.478152 -3.298714  0.674685 -0.206624]

In [117]:
pieces = [df[:3], df[3:7], df[7:]];pieces

[          0         1         2         3
 0  0.909707  0.323730  1.043909 -0.481896
 1 -0.565414  0.694983  1.154228 -3.198325
 2 -1.540122 -0.524849  1.205430 -0.464659,
           0         1         2         3
 3  0.582503  0.973116 -0.052731 -1.381555
 4 -2.563025  0.062843 -1.491904  0.667223
 5  0.214012  0.971047 -1.289668 -0.088493
 6 -0.713274 -1.939280 -1.025596  0.641043,
           0         1         2         3
 7  0.688676  0.188906 -0.028869 -0.831041
 8 -0.499909  0.237228 -0.191196  1.054962
 9 -2.478152 -3.298714  0.674685 -0.206624]

In [120]:
pd.concat(pieces)

          0         1         2         3
0  0.909707  0.323730  1.043909 -0.481896
1 -0.565414  0.694983  1.154228 -3.198325
2 -1.540122 -0.524849  1.205430 -0.464659
3  0.582503  0.973116 -0.052731 -1.381555
4 -2.563025  0.062843 -1.491904  0.667223
5  0.214012  0.971047 -1.289668 -0.088493
6 -0.713274 -1.939280 -1.025596  0.641043
7  0.688676  0.188906 -0.028869 -0.831041
8 -0.499909  0.237228 -0.191196  1.054962
9 -2.478152 -3.298714  0.674685 -0.206624

In [126]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

left

   key  lval
0  foo     1
1  bar     2

In [127]:
right

   key  rval
0  foo     4
1  bar     5

In [1]:
pd.merge(left, right, how= on='key') # key가 일치해야 merge됨

SyntaxError: invalid syntax (<ipython-input-1-cf618efae8d4>, line 1)

In [138]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
   ....:                      'A': ['A0', 'A1', 'A2', 'A3'],
   ....:                      'B': ['B0', 'B1', 'B2', 'B3']})

left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [140]:
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
   ....:                       'C': ['C0', 'C1', 'C2', 'C3'],
   ....:                       'D': ['D0', 'D1', 'D2', 'D3']})

right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [135]:
In [39]: left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
   ....:                      'A': ['A0', 'A1', 'A2', 'A3'],
   ....:                      'B': ['B0', 'B1', 'B2', 'B3']})
   ....: 

In [40]: right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
   ....:                       'C': ['C0', 'C1', 'C2', 'C3'],
   ....:                       'D': ['D0', 'D1', 'D2', 'D3']})
   ....: 

pd.merge(left, right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

# joining on index

In [145]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
   ....:                      'B': ['B0', 'B1', 'B2']},
   ....:                     index=['K0', 'K1', 'K2'])
   ....: 
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [147]:
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
   ....:                       'D': ['D0', 'D2', 'D3']},
   ....:                      index=['K0', 'K2', 'K3'])

right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [148]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [149]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [150]:
left.join(right, how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [152]:
pd.merge(left, right, left_index=True, right_index=True, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [154]:
pd.merge(left, right, left_index=True, right_index=True, how='inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [157]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
   ....:                          'foo', 'bar', 'foo', 'foo'],
   ....:                    'B': ['one', 'one', 'two', 'three',
   ....:                          'two', 'two', 'one', 'three'],
   ....:                    'C': np.random.randn(8),
   ....:                    'D': np.random.randn(8)})
   ....: 
df

     A      B         C         D
0  foo    one -2.145839  0.256167
1  bar    one  1.643669  0.332161
2  foo    two -0.818808  0.883160
3  bar  three -1.563734 -0.789621
4  foo    two  0.448068 -0.485900
5  bar    two  0.998951  1.066730
6  foo    one -0.031271 -0.376679
7  foo  three  0.617127  1.858821

In [163]:
df.groupby('A').sum()

            C         D
A
bar  1.078886  0.609270
foo -1.930722  2.135569

# Reshaping

In [165]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
   ....:                      'foo', 'foo', 'qux', 'qux'],
   ....:                     ['one', 'two', 'one', 'two',
   ....:                      'one', 'two', 'one', 'two']]))
   ....: 

tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [169]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [171]:
df

                     A         B
first second
bar   one     2.589207  0.711350
      two    -0.446500  1.009011
baz   one    -0.192065  0.793404
      two    -1.466340 -1.654408
foo   one    -0.082132 -0.954566
      two    -1.340929  0.981447
qux   one    -0.053546  0.980356
      two    -0.613690 -1.639596

In [174]:
df2 = df[:4]
df2

                     A         B
first second
bar   one     2.589207  0.711350
      two    -0.446500  1.009011
baz   one    -0.192065  0.793404
      two    -1.466340 -1.654408

In [182]:
stacked = df2.stack()
stacked

first  second
bar    one     A    2.589207
               B    0.711350
       two     A   -0.446500
               B    1.009011
baz    one     A   -0.192065
               B    0.793404
       two     A   -1.466340
               B   -1.654408
dtype: float64

# unstack

In [178]:
stacked.unstack()

                     A         B
first second
bar   one     2.589207  0.711350
      two    -0.446500  1.009011
baz   one    -0.192065  0.793404
      two    -1.466340 -1.654408

In [180]:
stacked.unstack(1)

second        one       two
first
bar   A  2.589207 -0.446500
      B  0.711350  1.009011
baz   A -0.192065 -1.466340
      B  0.793404 -1.654408

In [183]:
stacked.unstack(0)

first          bar       baz
second
one    A  2.589207 -0.192065
       B  0.711350  0.793404
two    A -0.446500 -1.466340
       B  1.009011 -1.654408

# Time series

In [185]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample('5Min').sum()

2012-01-01    25467
Freq: 5T, dtype: int32

In [188]:
dti = pd.date_range('2018-01-01', periods=3, freq='H')

dti

DatetimeIndex(['2018-01-01 00:00:00', '2018-01-01 01:00:00',
               '2018-01-01 02:00:00'],
              dtype='datetime64[ns]', freq='H')

In [192]:
idx = pd.date_range('2018-01-01', periods=5, freq='H')
idx

DatetimeIndex(['2018-01-01 00:00:00', '2018-01-01 01:00:00',
               '2018-01-01 02:00:00', '2018-01-01 03:00:00',
               '2018-01-01 04:00:00'],
              dtype='datetime64[ns]', freq='H')

In [193]:
ts = pd.Series(range(len(idx)), index=idx)

ts

2018-01-01 00:00:00    0
2018-01-01 01:00:00    1
2018-01-01 02:00:00    2
2018-01-01 03:00:00    3
2018-01-01 04:00:00    4
Freq: H, dtype: int64

# categoricals

In [204]:
df = pd.DataFrame({"id": [1, 2, 3, 4, 5, 6],
   .....:                    "raw_grade": ['a', 'b', 'b', 'a', 'a', 'e']})
   .....: 
df["grade"] = df["raw_grade"].astype("category")

df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [205]:
df["grade"].cat.categories

Index(['a', 'b', 'e'], dtype='object')

In [201]:
df.sort_values(by="grade")

   id raw_grade      grade
0   1         a  very good
3   4         a  very good
4   5         a  very good
1   2         b       good
2   3         b       good
5   6         e   very bad